W8D1/RedditClone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        # debugger
        @sub.moderator_id = current_user.id # come back if errors

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "coffee"], ["description", "the good stuff"], ["moderator_id", 2], ["created_at", "2020-03-30 22:32:04.652753"], ["updated_at", "2020-03-30 22:32:04.652753"]]

    def update
        @sub = current_user.subs.find_by(id: params[:id])
        # debugger
        if @sub && @sub.update
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "writing"], ["description", "i love writing"], ["updated_at", "2020-03-30 23:08:19.242292"], ["id", 5]]