W6D5/art_share/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        artwork_shares = ArtworkShare.all

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def show
        artwork_share = ArtworkShare.find(params[:id])