W6D5/art_share/app/controllers/artworks_controller.rb

    def index # to pull by artist_id
        artworks = Artwork.where(artist_id: params[:user_id])
        artworks_shared = ArtworkShare.where(viewer_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 AND "artworks"."artist_id" IS NULL  [["artist_id", 7]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 7]]