W6D5/art_share/app/controllers/comments_controller.rb

    def index
        render json: Comment.all
---
SELECT "comments".* FROM "comments"

    def show
        comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]