W6D5/art_share/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "username1"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if params[:user][:query]
            users = User.where("username LIKE '#{params[:user][:query]}%'")
        else
            users = User.all

SELECT "users".* FROM "users" WHERE (username LIKE 'username1')
---
    def show
        user = User.find(params[:id])