W7D3/MusicApp/app/controllers/application_controller.rb

    def current_user
        return nil if session[:session_token].nil?
        # user = User.find_by(session_token: session[:session_token])
        @user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "NuTZg5I-qslkB3mM_5T6QA"], ["LIMIT", 1]]