W7D3/MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "jamez and the jamezettes"], ["created_at", "2020-03-25 23:21:23.535656"], ["updated_at", "2020-03-25 23:21:23.535656"]]
---
    def create
        @band = Band.new(band_params)

        if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["name", "jamz and the jamzettes"], ["updated_at", "2020-03-25 23:52:06.867993"], ["id", 1]]
---
    def update
        @band = Band.find_by(id: params[:id])

        if @band.update(band_params)