W7D3/MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "8C8FIZd18ytOQLv9BomaBA"], ["updated_at", "2020-03-25 21:50:28.195738"], ["id", 2]]
---
    def create
        @user = User.create(user_params)

        if @user.save