W11D4/BenchBnb/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "6bJYJerDkMkkREghVBRPkA"], ["LIMIT", 1]]
---
  def current_user
    return nil unless session[:session_token]
    @user ||= User.find_by(session_token: session[:session_token])