W7D3/MusicApp/app/models/user.rb

    def reset_session_token! # reminder: generates a new session token
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "0sFawINxGJWzVkCdTNDlNg"], ["updated_at", "2020-03-25 21:49:27.523162"], ["id", 1]]